def area(a, b):
    '''
    Возвращает площадь прямоугольника.
        Параметры:
            a (int/float): первая сторона прямоугольника
            b (int/float): вторая сторона прямоугольника
        Возвращаемое значение:
            x (int/float): площадь прямоугольника
    '''
    return a * b

def perimeter(a, b):
    '''
    Возвращает периметр прямоугольника.
        Параметры:
            a (int/float): первая сторона прямоугольника
            b (int/float): вторая сторона прямоугольника
        Возвращаемое значение:
            x (int/float): периметр прямоугольника
    '''
    return (a + b) * 2

