def area(a, b):
    '''
    возвращает площадь прямоугольника
        параметры:
            a (int|float): первая сторона прямоугольника
            b (int|float): вторая сторона прямоугольника
        возвращаемое значение:
            x (int|float): площадь прямоугольника
    '''
    return a * b

def perimeter(a, b):
    '''
    возвращает периметр прямоугольника
        параметры:
            a (int|float): первая сторона прямоугольника
            b (int|float): вторая сторона прямоугольника
        возвращаемое значение:
            x (int|float): периметр прямоугольника
    '''
    return (a + b) * 2

