def area(a, h):
    '''
    возвращает площадь треугольника
        параметры:
            a (int|float): основание треугольника
            h (int|float): высота треугольника, опущенная на сторону a
        возвращаемое значение:
            x (float): площадь треугольника
    '''
    return a * h / 2

def perimeter(a, b, c):
    '''
    позвращает периметр треугольника
        параметры:
            a (int|float): первая сторона треугольника
            b (int|float): вторая сторона треугольника
            c (int|float): третья сторона треугольника
        возвращаемое значение:
            x (int|float): периметр треугольника
    '''
    return a + b + c


    