def area(a, h):
    '''
    Возвращает площадь треугольника.
        Параметры:
            a (int/float): основание треугольника
            h (int/float): высота треугольника, опущенная на основание a
        Возвращаемое значение:
            x (float): площадь треугольника
    '''
    return a * h / 2

def perimeter(a, b, c):
    '''
    Возвращает периметр треугольника.
        Параметры:
            a (int/float): первая сторона треугольника
            b (int/float): вторая сторона треугольника
            c (int/float): третья сторона треугольника
        Возвращаемое значение:
            x (int/float): периметр треугольника
    '''
    return a + b + c